Revit 2026 API

# SpatialElementTagTagOrientation Property

---

The orientation of the tag.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SpatialElementTagOrientation TagOrientation { get; set; }
```
```vb
Public Property TagOrientation As SpatialElementTagOrientation
	Get
	Set
```
```cpp
public:
property SpatialElementTagOrientation TagOrientation {
	SpatialElementTagOrientation get ();
	void set (SpatialElementTagOrientation value);
}
```
```fsharp
member TagOrientation : SpatialElementTagOrientation with get, set
```

#### Property Value

SpatialElementTagOrientation

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

See [!:Autodesk::Revit::DB::getSpatialElementTagOrientation] for the supported orientations.

#### Reference

SpatialElementTag Class

Autodesk.Revit.DB Namespace